#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_password.db_password: Refreshing state... [id=none]
module.symbosis_my_sql_db.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=4k0vyw]
module.fargate.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecs_task_execution_role]
module.fargate.module.ecs_cluster.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:ap-southeast-1:813661051760:cluster/symbiosis-fargate]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0f6d24203879696c8]
module.symbosis_my_sql_db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=symbiosisdb-dev-20210801154442919400000002]
module.symbosis_my_sql_db.module.db_option_group.aws_db_option_group.this[0]: Refreshing state... [id=symbiosisdb-dev-20210801154442917800000001]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0df755c861a2fc51e]
module.fargate.aws_security_group.fargate_container_sg: Refreshing state... [id=sg-0288e27a00d7204ac]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0bc1aba1b87a56689]
module.vpc.aws_subnet.database[2]: Refreshing state... [id=subnet-0fb6c1b209427f7bc]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-05ebf070136c8abbd]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0616c973b84ee20ec]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c3282502f9a61021]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0825bb260796801fa]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0335b1d7c8a47991d]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-08822dee371896487]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0a212fae540e87970]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-060b76adbc149b22f]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-055cf42fc31bf6363]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-078a64106222b49c5]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0bce4952f15cf29e8]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=symbiosis-vpc]
module.alb_public.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:813661051760:loadbalancer/app/symbiosis-alb/c37f3db9a41c31ee]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0da8b24a788434417]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-03e1d4b643292d184]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0b4876c1ff3e7133b]
module.vpc.aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-0dea78c2e9bb523b8]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0da11a362b8b2280c]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-054a6c4f753ddf313]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-060156898172a9163]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0cd6d6a7eb3f9a80c]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0d9d95d688c8bc1ec]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0bce4952f15cf29e81080289494]
module.symbosis_my_sql_db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=symbiosisdb-dev]
module.alb_public.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:813661051760:targetgroup/pref-20210801161529394000000001/929981ade85d5e0e]
module.fargate.aws_ecs_task_definition.ecs_task_definition: Refreshing state... [id=symbiosis-service]
module.fargate.aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:ap-southeast-1:813661051760:service/symbiosis-fargate/symbiosis-service]
module.alb_public.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-1:813661051760:listener/app/symbiosis-alb/c37f3db9a41c31ee/9aa92413e8b2cc67]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.fargate.aws_ecs_service.ecs_service has been changed
  ~ resource "aws_ecs_service" "ecs_service" {
        id                                 = "arn:aws:ecs:ap-southeast-1:813661051760:service/symbiosis-fargate/symbiosis-service"
        name                               = "symbiosis-service"
      + tags                               = {}
        # (14 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }
  # module.fargate.aws_security_group.fargate_container_sg has been changed
  ~ resource "aws_security_group" "fargate_container_sg" {
        id                     = "sg-0288e27a00d7204ac"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Ingress from other containers in the same security group"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = "Ingress from the private ALB"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = []
              + description      = "Ingress from the public ALB"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
            # (1 unchanged element hidden)
        ]
        name                   = "terraform-20210801145931738300000003"
        tags                   = {}
        # (8 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.fargate.aws_security_group.fargate_container_sg will be updated in-place
  ~ resource "aws_security_group" "fargate_container_sg" {
        id                     = "sg-0288e27a00d7204ac"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Ingress from other containers in the same security group"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = []
              + description      = "Ingress from the private ALB"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = "Ingress from the public ALB"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
            # (1 unchanged element hidden)
        ]
        name                   = "terraform-20210801145931738300000003"
        tags                   = {}
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "symbiosis-vpc-ap-southeast-1a"
        }
      + tags_all             = {
          + "Name"                 = "symbiosis-vpc-ap-southeast-1a"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
      + vpc                  = true
    }

  # module.vpc.aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "symbiosis-vpc-ap-southeast-1b"
        }
      + tags_all             = {
          + "Name"                 = "symbiosis-vpc-ap-southeast-1b"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
      + vpc                  = true
    }

  # module.vpc.aws_eip.nat[2] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "symbiosis-vpc-ap-southeast-1c"
        }
      + tags_all             = {
          + "Name"                 = "symbiosis-vpc-ap-southeast-1c"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
      + vpc                  = true
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = "subnet-0616c973b84ee20ec"
      + tags                 = {
          + "Name" = "symbiosis-vpc-ap-southeast-1a"
        }
      + tags_all             = {
          + "Name"                 = "symbiosis-vpc-ap-southeast-1a"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
    }

  # module.vpc.aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = "subnet-08822dee371896487"
      + tags                 = {
          + "Name" = "symbiosis-vpc-ap-southeast-1b"
        }
      + tags_all             = {
          + "Name"                 = "symbiosis-vpc-ap-southeast-1b"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
    }

  # module.vpc.aws_nat_gateway.this[2] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = "subnet-0a212fae540e87970"
      + tags                 = {
          + "Name" = "symbiosis-vpc-ap-southeast-1c"
        }
      + tags_all             = {
          + "Name"                 = "symbiosis-vpc-ap-southeast-1c"
          + "app"                  = "symbiosis"
          + "app_owner"            = "symbiosis_owner"
          + "business_criticality" = "mission-critical"
          + "cost_center"          = "symbiosis_cost_center"
          + "data_classification"  = "public"
          + "environment"          = "dev"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-060b76adbc149b22f"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-055cf42fc31bf6363"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[2] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-078a64106222b49c5"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

Plan: 9 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @logamanig, Action: `pull_request`, Working Directory: `./challenge1`, Workflow: `Terraform Plan - Dev`*